//var arrMoonCake = Array(


var arrKrathong = Array(
  [0, 'กระทง#1'],
  [1, 'กระทง#2'],
  [2, 'กระทง#3'],
  [3, 'กระทง#4'],
  [4, 'กระทง#5'],
  [5, 'กระทง#6'],
  [6, 'กระทง#7'],
  [7, 'กระทง#8'],
  [8, 'กระทง#9']
/*
  [0, 'map-0.jpg'],
  [1, 'map-1.jpg'],
  [2, 'map-2.jpg'],
  [3, 'map-3.jpg'],
  [4, 'map-4.jpg'],
  [5, 'map-5.jpg'],
  [6, 'map-6.jpg']
*/
);

var arrTextMemo = Array(
  [0, 'ดอกบัว', 'ขอให้สิ่งที่ดีที่สุดในปี 2567 ที่กำลังมาถึงนี้ ดียิ่งกว่าปีที่ผ่านมา และขอให้เป็นปีที่ดียิ่งๆ ขึ้นไป สวัสดีปีใหม่ 2567'],
  [1, 'ดอกจำปี', 'ในวารดิถีขึ้นปีใหม่ 2567 ขออำนาจคุณพระศรีรัตนตรัย จงดลบันดาลให้ท่านและครอบครัวพบแต่ความสุข เจริญรุ่งเรืองในหน้าที่การงาน'],
  [2, 'กุหลาบ', 'ในช่วงเวลาแสนพิเศษเทศกาลปีใหม่ 2567 ขอส่งความปรารถนาดีและความห่วงใย ขอให้ทุกวันล้วนเป็นวันที่สดใสไปตลอดทั้งปี'],
  [3, 'ดาวเรือง', 'สวัสดีปีใหม่ 2567 ขอคุณพระศรีรัตนตรัยจงบันดาลให้ท่านและครอบครัวพบกับความเรืองรองในชีวิต มีความรักและพลังใจดีๆ'],
  [4, 'กล้วยไม้', 'ขอให้แสงไฟอันเรืองรองและเปล่งประกายของพลุที่จุดในคืนปีใหม่ 2567 ช่วยเติมจิตใจให้สงบ เบิกบาน และทำให้ปีใหม่นี้ของท่านเป็นปีที่สดใส เปล่งประกายเช่นเดียวกับพลุ'],
  [5, 'บานไม่รู้โรย', 'ปีใหม่นี้ ขอให้คลายจากทุกข์โศกให้ปลอดโรคพ้นภัย เต็มไปด้วยโชคลาภและเงินทอง ให้สมหวังดั่งใจเทอญ'],
  [6, 'ดอกเข็ม', 'เนื่องในโอกาสศุภวารดิถีขึ้นปีใหม่ ขออำนาจสิ่งศักดิ์สิทธิ์ทั้งหลายโปรดดลบันดาลให้ท่านประสบแต่ความสุข ความเจริญ ปรารถนาสิ่งใดขอให้สัมฤทธิผล'],
  [7, 'ดอกพุด', 'ในอภิลักขิตสมัยขึ้นปีใหม่ ขออำนาจคุณพระศรีรัตนตรัยและสิ่งศักดิ์สิทธิ์ทั้งหลาย ดลบันดาลให้ท่านประสบแต่ความสุขด้วยเทอญ'],
  [8, 'ดอกมะลิ', 'ในวาระปีใหม่ 2567 ขออำนาจสิ่งศักดิ์สิทธิ์ในสากลโลก ดลบันดาลให้ท่านมีแต่ความสุข ปราศจากโรคภัย แข็งแรงยิ่งๆ ขึ้นเทอญ']
);

var arrPerson = Array(
  [0, 'ชาย'],
  [1, 'ชาย'],
  [2, 'ชาย'],
  [3, 'ชาย'],
  [4, 'ชาย'],
  [5, 'หญิง'],
  [6, 'หญิง'],
  [7, 'หญิง'],
  [8, 'หญิง']
);

var arrMap = Array(
  [0, 'map-0.jpg'],
  [1, 'map-1.jpg'],
  [2, 'map-2.jpg'],
  [3, 'map-3.jpg'],
  [4, 'map-4.jpg'],
  [5, 'map-5.jpg'],
  [6, 'map-6.jpg']

  /*
  [0, 'กระทง#1'],
  [1, 'กระทง#2'],
  [2, 'กระทง#3'],
  [3, 'กระทง#4'],
  [4, 'กระทง#5'],
  [5, 'กระทง#6'],
  [6, 'กระทง#7'],
  [7, 'กระทง#8'],
  [8, 'กระทง#9']
  */
);

/*

⭐ ดอกบัว  ความสำเร็จในชีวิต
⭐ ดอกจำปี การเงินปัง ตลอดปี
⭐ ดอกกุหลาบ ให้ความรักสมหวัง
⭐ ดอกดาวเรือง การงาน การเงิน
⭐ ดอกกล้วยไม้ สุขภาพแข็งแรง ไม่มีโรค
⭐ ดอกบานไม่รู้โรย  ความรักที่ยาวนาน
⭐ ดอกเข็ม การเรียน การงานผ่านฉลุย
⭐ ดอกพุด ...
⭐ ดอกมะลิ ...


*/
//
//var arrLocation = ['สนญ.','ประชาอุทิศ','จันทน์','บางกอกน้อย','สมุทรปราการ','นนทบุรี'];
//var arrLocationE = ['loy-1','loy-2','loy-3','loy-4','fai-fah-samuthprakarn','fai-fah-nonthaburi'];
//var arrInterest = ['ศิลปะ','กีฬา','ดนตรีและ<br>การแสดง','ภาษา','ครัว ขนม<br>และเบเกอรี่','การออกแบบ<br>สิ่งทอ','การออกแบบ<br>อุตสาหกรรม','ท่องเที่ยวเพื่อ<br>ชุมชนยั่งยืน'];
//var arrInterestE = ['art','sport','drama','language','cook','carft','industry','travel'];


function Connect_DB() {
  var firebaseConfig = {
    apiKey: "AIzaSyDfTJJ425U4OY0xac6jdhtSxDeuJ-OF-lE",
    authDomain: "retailproject-6f4fc.firebaseapp.com",
    projectId: "retailproject-6f4fc",
    databaseURL: "https://file-upload-6f4fc.firebaseio.com",
    storageBucket: "retailproject-6f4fc.appspot.com",
    messagingSenderId: "653667385625",
    appId: "1:653667385625:web:a5aed08500de80839f0588",
    measurementId: "G-9SKTRHHSW9"
  };
  firebase.initializeApp(firebaseConfig);
}
